Revit 2027 API
PlanCircuitSet.Contains Method
Tests for the existence of an item within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	PlanCircuit item
)
Public Overridable Function Contains (
	item As PlanCircuit
) As Boolean
public:
virtual bool Contains(
	PlanCircuit^ item
)
abstract Contains :
        item : PlanCircuit -> bool
override Contains :
        item : PlanCircuit -> bool
Parameters
item PlanCircuit
The item to be searched for.
Return Value
Boolean
The Contains method returns True if the item is within the set, otherwise False.
See Also
Reference
PlanCircuitSet Class
Autodesk.Revit.DB Namespace